Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.Code Property
 The connection code of the executable connection instance. The maximum length is 22 characters.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Code { get; set; }
Public Property Code As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ConnectionBase Class
Tekla.Structures.Plugins Namespace